app/views/search/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 1
SELECT 1 AS one FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 1 LIMIT 1
---
          <p><strong>Categories:</strong>
            <% if quote.categories.any? %>
              <%= quote.categories.map(&:category_name).join(', ') %>