app/views/home/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3)
---
        <% if quote.user %>
          <%= quote.user.first_name %> <%= quote.user.last_name %>

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 1
SELECT 1 AS one FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 1 LIMIT 1
---
      <p><strong>Categories:</strong>
        <% if quote.categories.any? %>
          <ul>
            <% quote.categories.each do |category| %>