app/controllers/home_controller.rb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (1, 2, 3, 4)
SELECT "quotes".* FROM "quotes" LIMIT 5
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 3)
---
  def index
    @quotes = Quote.includes(:philosopher, :user).limit(5)