app/controllers/search_controller.rb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 1
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "philosophers" ON "philosophers"."id" = "quotes"."philosopher_id" INNER JOIN "quote_categories" ON "quote_categories"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quote_categories"."category_id" WHERE (quote_text LIKE '%Man is condemned to be free%'
---
  def index
    quote_query = params[:quote_query]

    if quote_query.present?
      @quotes = Quote.joins(:philosopher, :categories)
                     .where("quote_text LIKE :query
                             OR philosophers.phil_first_name LIKE :query
                             OR philosophers.phil_last_name LIKE :query
                             OR categories.category_name LIKE :query",
                            query: "%#{quote_query}%")
                     .distinct