app/controllers/sessions_controller.rb

  def create
    # Find the user by email
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'nadun@example.com' LIMIT 1